scenarios_jmeter/test_results/statistics.json
{
  "Imprimir token_response" : {
    "transaction" : "Imprimir token_response",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 307.12890625,
    "sentKBytesPerSec" : 0.0
  },
  "Descargar archivo" : {
    "transaction" : "Descargar archivo",
    "sampleCount" : 2000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 121.69600000000001,
    "medianResTime" : 121.0,
    "minResTime" : 116.0,
    "maxResTime" : 156.0,
    "pct1ResTime" : 125.0,
    "pct2ResTime" : 128.0,
    "pct3ResTime" : 133.99,
    "throughput" : 39.92414412616029,
    "receivedKBytesPerSec" : 14.776611937319094,
    "sentKBytesPerSec" : 18.714442559137638
  },
  "Signup" : {
    "transaction" : "Signup",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 160.0,
    "medianResTime" : 160.0,
    "minResTime" : 160.0,
    "maxResTime" : 160.0,
    "pct1ResTime" : 160.0,
    "pct2ResTime" : 160.0,
    "pct3ResTime" : 160.0,
    "throughput" : 6.25,
    "receivedKBytesPerSec" : 1.263427734375,
    "sentKBytesPerSec" : 2.056884765625
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2003,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 121.65601597603595,
    "medianResTime" : 121.0,
    "minResTime" : 2.0,
    "maxResTime" : 160.0,
    "pct1ResTime" : 125.0,
    "pct2ResTime" : 128.0,
    "pct3ResTime" : 134.0,
    "throughput" : 39.71999682715951,
    "receivedKBytesPerSec" : 14.704113259250814,
    "sentKBytesPerSec" : 18.602481508289046
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 123.0,
    "medianResTime" : 123.0,
    "minResTime" : 123.0,
    "maxResTime" : 123.0,
    "pct1ResTime" : 123.0,
    "pct2ResTime" : 123.0,
    "pct3ResTime" : 123.0,
    "throughput" : 8.130081300813009,
    "receivedKBytesPerSec" : 3.6442454268292686,
    "sentKBytesPerSec" : 2.0880970528455283
  }
}