scenarios_jmeter/test_results_1_GET_25_2/statistics.json
{
  "Imprimir token_response" : {
    "transaction" : "Imprimir token_response",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 306.15234375,
    "sentKBytesPerSec" : 0.0
  },
  "Descargar archivo" : {
    "transaction" : "Descargar archivo",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 923.1199999999999,
    "medianResTime" : 794.0,
    "minResTime" : 564.0,
    "maxResTime" : 1824.0,
    "pct1ResTime" : 1501.2000000000003,
    "pct2ResTime" : 1749.2999999999997,
    "pct3ResTime" : 1824.0,
    "throughput" : 7.856693903205531,
    "receivedKBytesPerSec" : 11788.616264338467,
    "sentKBytesPerSec" : 3.6521350565681963
  },
  "Signup" : {
    "transaction" : "Signup",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 167.0,
    "medianResTime" : 167.0,
    "minResTime" : 167.0,
    "maxResTime" : 167.0,
    "pct1ResTime" : 167.0,
    "pct2ResTime" : 167.0,
    "pct3ResTime" : 167.0,
    "throughput" : 5.9880239520958085,
    "receivedKBytesPerSec" : 1.2104696856287425,
    "sentKBytesPerSec" : 1.9589726796407185
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 28,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 834.6071428571428,
    "medianResTime" : 788.5,
    "minResTime" : 2.0,
    "maxResTime" : 1824.0,
    "pct1ResTime" : 1464.3000000000002,
    "pct2ResTime" : 1711.9499999999994,
    "pct3ResTime" : 1824.0,
    "throughput" : 7.93425899688297,
    "receivedKBytesPerSec" : 10629.821379551573,
    "sentKBytesPerSec" : 3.457955511476339
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 122.0,
    "medianResTime" : 122.0,
    "minResTime" : 122.0,
    "maxResTime" : 122.0,
    "pct1ResTime" : 122.0,
    "pct2ResTime" : 122.0,
    "pct3ResTime" : 122.0,
    "throughput" : 8.196721311475411,
    "receivedKBytesPerSec" : 3.6741162909836067,
    "sentKBytesPerSec" : 2.089203381147541
  }
}