scenarios_jmeter/test_results_1_GET_31_2/statistics.json
{
  "Imprimir token_response" : {
    "transaction" : "Imprimir token_response",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0,
    "medianResTime" : 2.0,
    "minResTime" : 2.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 500.0,
    "receivedKBytesPerSec" : 306.15234375,
    "sentKBytesPerSec" : 0.0
  },
  "Descargar archivo" : {
    "transaction" : "Descargar archivo",
    "sampleCount" : 31,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1411.6129032258068,
    "medianResTime" : 1273.0,
    "minResTime" : 571.0,
    "maxResTime" : 2483.0,
    "pct1ResTime" : 2321.4,
    "pct2ResTime" : 2436.2,
    "pct3ResTime" : 2483.0,
    "throughput" : 7.425149700598802,
    "receivedKBytesPerSec" : 11141.103574101797,
    "sentKBytesPerSec" : 3.4515344311377247
  },
  "Signup" : {
    "transaction" : "Signup",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 166.0,
    "medianResTime" : 166.0,
    "minResTime" : 166.0,
    "maxResTime" : 166.0,
    "pct1ResTime" : 166.0,
    "pct2ResTime" : 166.0,
    "pct3ResTime" : 166.0,
    "throughput" : 6.024096385542169,
    "receivedKBytesPerSec" : 1.217761671686747,
    "sentKBytesPerSec" : 1.9707737198795179
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 34,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1295.5294117647059,
    "medianResTime" : 1163.5,
    "minResTime" : 2.0,
    "maxResTime" : 2483.0,
    "pct1ResTime" : 2263.5,
    "pct2ResTime" : 2424.5,
    "pct3ResTime" : 2483.0,
    "throughput" : 7.533791269665412,
    "receivedKBytesPerSec" : 10306.973214533016,
    "sentKBytesPerSec" : 3.322000332373144
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 120.0,
    "medianResTime" : 120.0,
    "minResTime" : 120.0,
    "maxResTime" : 120.0,
    "pct1ResTime" : 120.0,
    "pct2ResTime" : 120.0,
    "pct3ResTime" : 120.0,
    "throughput" : 8.333333333333334,
    "receivedKBytesPerSec" : 3.7353515625,
    "sentKBytesPerSec" : 2.1240234375
  }
}